#include <iostream>
using namespace std;
int main() {
	//Необходимо, чтоб программа выводила на экран вот такую последовательность :
//7 14 21 28 35 42 49 56 63 70 77 84 91 98

	/*int i = 7;
	int sum = 0
	while (i <= 98) {
		sum += i;
		i += 7;
	}
	cout << sum << " ";
	*/
		//Необходимо вывести на консоль такую последовательность чисел :
//1 2 4 8 16 32 64 128 256 512
	/*int i = 1;
	while (i <= 512) {
		cout << i << " ";
	}*/
	//8. Даны натуральные числа от 20 до 50.Напечатать те из них, которые делятся на 3, но не делятся на 5.
	/*int i = 20;
	while (i <= 50) {
		if ((i % 3 == 0) || (i % 5 != 0)) 
	}
			cout << i << " ";
			i += 1;
		}*/
	//9. даны натуральные числа от 35 до 87. Найти и напечатать те из них, которые при делении на 7 дают остаток 1, 2 или 5
	/*int i = 35;
	while (i <= 87) {
		if ((1 == i % 7) || (2 == i % 7) || (5 == i % 7));
		cout << i << " ";
		i += 1;*/
	//10. Даны натуральные числа от 1 до 50. Найти сумму тех из них, которые делятся на 5 или на 7.
	int i = 1;
    int sum = 0;
    while (i <= 50) {
        if ((i % 5) || (i % 7));
        sum += i;
        i += 1;
	}
	cout << sum << " ";
	//11. Напечатать те из двузначных чисел которые делятся на 4, но не делятся на 6.
	int i1 ;
	int i2 ;
	while (i1 <= i2) {
		if ((i1 % 4 == 0) || (i2 % 6 != 0));
		i1 += 1;
		i2 += 1;
	}
	cout << i1 << i2 << " ";

		



	




             


		

		

			 
	










}